Table of Contents
 Class LineSupport
Namespace
IdeaRS.OpenModel.Detail
Assembly
IdeaRS.OpenModel.dll
Line support
public class LineSupport : OpenElementId
Inheritance
object
OpenObject
OpenElementId
LineSupport
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 LineSupport()
constructor
public LineSupport()
Properties
 Direction
local / global
public LoadDirection Direction { get; set; }
Property Value
LoadDirection
 EdgePositionType
edge position type
public EdgeOrientationType EdgePositionType { get; set; }
Property Value
EdgeOrientationType
 GeneralLine
general shape
public PolyLine2D GeneralLine { get; set; }
Property Value
PolyLine2D
 GeomId
Id representing geometrical parts of Detail
public int GeomId { get; set; }
Property Value
int
 GeometryPointsPath
list of line load points
public Polygon2D GeometryPointsPath { get; set; }
Property Value
Polygon2D
 IsPressureOnlyY
pressure only for Y
public bool IsPressureOnlyY { get; set; }
Property Value
bool
 IsUserStiffnessX
true for user stiffness
public bool IsUserStiffnessX { get; set; }
Property Value
bool
 IsUserStiffnessY
true for user stiffness
public bool IsUserStiffnessY { get; set; }
Property Value
bool
 MasterComponent
Gets or sets the master component
public ReferenceElement MasterComponent { get; set; }
Property Value
ReferenceElement
 MasterEdge
master component edge
public int MasterEdge { get; set; }
Property Value
int
 Name
Gets or set the name
public string Name { get; set; }
Property Value
string
 OnWallEdge
true to add line support on wall edge
public bool OnWallEdge { get; set; }
Property Value
bool
 PositionOnEdge
position od edge
public double PositionOnEdge { get; set; }
Property Value
double
 Rz
rotation Rz
public bool Rz { get; set; }
Property Value
bool
 StiffnessRz
support stiffness Rz
public double StiffnessRz { get; set; }
Property Value
double
 StiffnessX
support stiffness X
public double StiffnessX { get; set; }
Property Value
double
 StiffnessY
support stiffness Y
public double StiffnessY { get; set; }
Property Value
double
 SupportLength
support lengtj
public double SupportLength { get; set; }
Property Value
double
 TypeEdgePosition
edge position type
public TypeEdgePosition TypeEdgePosition { get; set; }
Property Value
TypeEdgePosition
 X
displacement in X
public bool X { get; set; }
Property Value
bool
 Y
displacement in Y
public bool Y { get; set; }
Property Value
bool
 Edit this page